Menglingyu2333/RoadLineDetect_V1.0/RoadLineDetect_V1.0.si4project/Backup/system_at32f4xx(4360).c
#ifdef DATA_IN_ExtSRAM
static void SystemInit_ExtMemCtrl(void);
#endif /* DATA_IN_ExtSRAM */

/**
  * @}
  */

/** @addtogroup at32f4xx_System_Private_Functions
  * @{
  */

/**
  * @brief  Setup the microcontroller system
  *         Initialize the Embedded Flash Interface, the PLL and update the
  *         SystemCoreClock variable.
  * @note   This function should be used only after reset.
  * @param  None
  * @retval None
  */
void SystemInit (void)
{
#if defined (AT32F415xx)
  /* Enable low power mode, 0x40007050[bit2] */
  RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_PWR, ENABLE);
  *(volatile uint8_t *)(0x40007050) |= (uint8_t)(0x1 << 2);
  RCC_APB1PeriphClockCmd(RCC_APB1PERIPH_PWR, DISABLE);
#endif

#if defined (__FPU_USED) && (__FPU_USED == 1U)
  SCB->CPACR |= ((3U << 10U * 2U) |         /* set CP10 Full Access */
                 (3U << 11U * 2U)  );       /* set CP11 Full Access */
#endif

  /* Reset the RCC clock configuration to the default reset state(for debug purpose) */
  /* Set HSIEN bit */
  BIT_SET(RCC->CTRL, RCC_CTRL_HSIEN);

  /* Reset SW, AHBPSC, APB1PSC, APB2PSC, ADCPSC and CLKOUT bits */
  BIT_CLEAR(RCC->CFG, RCC_CFG_SYSCLKSEL | RCC_CFG_AHBPSC | \
            RCC_CFG_APB1PSC | RCC_CFG_APB2PSC | \
            RCC_CFG_ADCPSC | RCC_CFG_CLKOUT);

  /* Reset HSEEN, HSECFDEN and PLLEN bits */
  BIT_CLEAR(RCC->CTRL, RCC_CTRL_HSEEN | RCC_CTRL_HSECFDEN | \
            RCC_CTRL_PLLEN);

  /* Reset HSEBYPS bit */
  BIT_CLEAR(RCC->CTRL, RCC_CTRL_HSEBYPS);

  /* Reset PLLRC, PLLHSEPSC, PLLMUL, USBPSC and PLLRANGE bits */
  BIT_CLEAR(RCC->CFG, RCC_CFG_PLLRC | RCC_CFG_PLLHSEPSC | \
            RCC_CFG_PLLMULT | RCC_CFG_USBPSC | RCC_CFG_PLLRANGE);

  /* Reset USB768B, CLKOUT[3], HSICAL_KEY[7:0] */
  BIT_CLEAR(RCC->MISC, 0x010100FF);

  /* Disable all interrupts and clear pending bits  */
  RCC->CLKINT = RCC_CLKINT_LSISTBLFC | RCC_CLKINT_LSESTBLFC | \
                RCC_CLKINT_HSISTBLFC | RCC_CLKINT_HSESTBLFC | \
                RCC_CLKINT_PLLSTBLFC | RCC_CLKINT_HSECFDFC;

#ifdef DATA_IN_ExtSRAM
  SystemInit_ExtMemCtrl();
#endif /* DATA_IN_ExtSRAM */

  /* Configure the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers */
  /* Configure the Flash Latency cycles and enable prefetch buffer */
  SetSysClock();

#ifdef VECT_TAB_SRAM
  SCB->VTOR = SRAM_BASE | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal SRAM. */
#else
  SCB->VTOR = FLASH_BASE | VECT_TAB_OFFSET; /* Vector Table Relocation in Internal FLASH. */
#endif
}

/**
  * @brief  Update SystemCoreClock variable according to Clock Register Values.
  *         The SystemCoreClock variable contains the core clock (HCLK), it can
  *         be used by the user application to setup the SysTick timer or configure
  *         other parameters.
  *
  * @note   Each time the core clock (HCLK) changes, this function must be called
  *         to update SystemCoreClock variable value. Otherwise, any configuration
  *         based on this variable will be incorrect.
  *
  * @note   - The system frequency computed by this function is not the real
  *           frequency in the chip. It is calculated based on the predefined
  *           constant and the selected clock source:
  *
  *           - If SYSCLK source is HSI, SystemCoreClock will contain the HSI_VALUE(*)
  *
  *           - If SYSCLK source is HSE, SystemCoreClock will contain the HSE_VALUE(**)
  *
  *           - If SYSCLK source is PLL, SystemCoreClock will contain the HSE_VALUE(**)
  *             or HSI_VALUE(*) multiplied by the PLL factors.
  *
  *         (*) HSI_VALUE is a constant defined in at32f4xx.h file (default value
  *             8 MHz) but the real value may vary depending on the variations
  *             in voltage and temperature.
  *
  *         (**) HSE_VALUE is a constant defined in at32f4xx.h file (default value
  *              8 MHz or 25 MHz, depedning on the product used), user has to ensure
  *              that HSE_VALUE is same as the real frequency of the crystal used.
  *              Otherwise, this function may have wrong result.
  *
  *         - The result of this function could be not correct when using fractional
  *           value for HSE crystal.
  * @param  None
  * @retval None
  */
void SystemCoreClockUpdate (void)
{
  uint32_t tmp = 0, pllmult = 0, pllrefclk = 0, tempcfg = 0;

  /* Get SYSCLK source -------------------------------------------------------*/
  tmp = RCC->CFG & RCC_CFG_SYSCLKSTS;

  switch (tmp)
  {
  case RCC_CFG_SYSCLKSTS_HSI:  /* HSI used as system clock */
    SystemCoreClock = HSI_VALUE;
    break;

  case RCC_CFG_SYSCLKSTS_HSE:  /* HSE used as system clock */
    SystemCoreClock = HSE_VALUE;
    break;

  case RCC_CFG_SYSCLKSTS_PLL:  /* PLL used as system clock */
    /* Get PLL clock source and multiplication factor ----------------------*/
    pllrefclk = RCC->CFG & RCC_CFG_PLLRC;
    tempcfg = RCC->CFG;
    pllmult = RCC_GET_PLLMULT(tempcfg);

    if (pllrefclk == RCC_PLLRefClk_HSI_Div2)
    {
      /* HSI oscillator clock divided by 2 selected as PLL clock entry */
      SystemCoreClock = (HSI_VALUE >> 1) * pllmult;
    }
    else
    {
      /* HSE selected as PLL clock entry */
      if ((RCC->CFG & RCC_CFG_PLLHSEPSC) != (uint32_t)RESET)
      {
        /* HSE oscillator clock divided by 2 */
        SystemCoreClock = (HSE_VALUE >> 1) * pllmult;
      }
      else
      {
        SystemCoreClock = HSE_VALUE * pllmult;
      }
    }

    break;

  default:
    SystemCoreClock = HSI_VALUE;
    break;
  }

  /* Compute HCLK clock frequency ----------------*/
  /* Get HCLK prescaler */
  tmp = AHBPscTable[((RCC->CFG & RCC_CFG_AHBPSC) >> 4)];
  /* HCLK clock frequency */
  SystemCoreClock >>= tmp;
}

/**
  * @brief  Configures the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers.
  * @param  None
  * @retval None
  */
static void SetSysClock(void)
{
#ifdef SYSCLK_FREQ_HSE
  SetSysClockToHSE();
#elif defined SYSCLK_FREQ_24MHz
  SetSysClockTo24M();
#elif defined SYSCLK_FREQ_36MHz
  SetSysClockTo36M();
#elif defined SYSCLK_FREQ_48MHz
  SetSysClockTo48M();
#elif defined SYSCLK_FREQ_56MHz
  SetSysClockTo56M();
#elif defined SYSCLK_FREQ_72MHz
  SetSysClockTo72M();
#elif defined SYSCLK_FREQ_96MHz
  SetSysClockTo96M();
#elif defined SYSCLK_FREQ_108MHz
  SetSysClockTo108M();
#elif defined SYSCLK_FREQ_120MHz
  SetSysClockTo120M();
#elif defined SYSCLK_FREQ_144MHz
  SetSysClockTo144M();
#elif defined SYSCLK_FREQ_150MHz
  SetSysClockTo150M();
#elif defined SYSCLK_FREQ_168MHz
  SetSysClockTo168M();
#elif defined SYSCLK_FREQ_176MHz
  SetSysClockTo176M();
#elif defined SYSCLK_FREQ_192MHz
  SetSysClockTo192M();
#elif defined SYSCLK_FREQ_200MHz
  SetSysClockTo200M();
#elif defined SYSCLK_FREQ_224MHz
  SetSysClockTo224M();
#elif defined SYSCLK_FREQ_240MHz
  SetSysClockTo240M();
#elif defined SYSCLK_FREQ_24MHz_HSI
  SetSysClockTo24MHSI();
#elif defined SYSCLK_FREQ_36MHz_HSI
  SetSysClockTo36MHSI();
#elif defined SYSCLK_FREQ_48MHz_HSI
  SetSysClockTo48MHSI();
#elif defined SYSCLK_FREQ_56MHz_HSI
  SetSysClockTo56MHSI();
#elif defined SYSCLK_FREQ_72MHz_HSI
  SetSysClockTo72MHSI();
#elif defined SYSCLK_FREQ_96MHz_HSI
  SetSysClockTo96MHSI();
#elif defined SYSCLK_FREQ_108MHz_HSI
  SetSysClockTo108MHSI();
#elif defined SYSCLK_FREQ_120MHz_HSI
  SetSysClockTo120MHSI();
#elif defined SYSCLK_FREQ_144MHz_HSI
  SetSysClockTo144MHSI();
#elif defined SYSCLK_FREQ_150MHz_HSI
  SetSysClockTo150MHSI();
#elif defined SYSCLK_FREQ_168MHz_HSI
  SetSysClockTo168MHSI();
#elif defined SYSCLK_FREQ_176MHz_HSI
  SetSysClockTo176MHSI();
#elif defined SYSCLK_FREQ_192MHz_HSI
  SetSysClockTo192MHSI();
#elif defined SYSCLK_FREQ_200MHz_HSI
  SetSysClockTo200MHSI();
#elif defined SYSCLK_FREQ_224MHz_HSI
  SetSysClockTo224MHSI();
#elif defined SYSCLK_FREQ_240MHz_HSI
  SetSysClockTo240MHSI();
#endif

